RealxSCV/TomotachiLife-AutoDrawing/firmware/esp32/src/classic_bt_controller_transport.cpp
  if (hasPeerAddress_) {
    output.print("INFO bt_last_peer=");
    output.println(formatBluetoothAddress(lastPeerAddress_));
  }
}

const char *ClassicBtControllerTransport::name() const { return CONTROL_TRANSPORT; }

bool ClassicBtControllerTransport::isHidReportChannelOpen() const {
  return connected_ && appRegistered_ && hidReady_;
}

bool ClassicBtControllerTransport::isControllerInputReady() const {
  return isHidReportChannelOpen() && paired_;
}

bool ClassicBtControllerTransport::sendCurrentInputReport(bool logFailure, bool waitForSendEvent) {
  readyForReports_ = isHidReportChannelOpen();

  if (!readyForReports_) {
    if (logFailure) {
      Serial.printf(
          "WARN bt report skipped reason=not-ready connected=%s paired=%s\n",
          boolName(connected_),
          boolName(paired_));
    }
    return false;
  }

  updateInputReport();

  const bool shouldWaitForSendEvent = waitForSendEvent && paired_;
  uint32_t expectedEventCount = 0;
  const bool shouldSendFullReport = connected_ || paired_;
  const uint8_t *payload = shouldSendFullReport ? report30_ : dummyReport_;
  const size_t payloadLength = shouldSendFullReport ? sizeof(report30_) : sizeof(dummyReport_);

  if (inputReportSendMutex_ != nullptr) {
    xSemaphoreTakeRecursive(inputReportSendMutex_, portMAX_DELAY);
  }

  reportCongested_ = false;
  const esp_err_t err = esp_bt_hid_device_send_report(
      ESP_HIDD_REPORT_TYPE_INTRDATA,
      0x30,
      payloadLength,
      const_cast<uint8_t *>(payload));
  if (err == ESP_OK) {
    inputReportSubmitCount_ += 1;
    if (shouldWaitForSendEvent) {
      expectedEventCount = inputReportSubmitCount_;
    }
  }

  if (inputReportSendMutex_ != nullptr) {
    xSemaphoreGiveRecursive(inputReportSendMutex_);
  }

  if (err != ESP_OK) {
    sendReportFailureCount_ += 1;
    if (consecutiveSendReportFailures_ < UINT8_MAX) {
      consecutiveSendReportFailures_ += 1;
    }
    lastSendReportStatus_ = static_cast<int>(err);
    lastSendReportReason_ = 0;
    lastSendReportId_ = 0x30;
    readyForReports_ = isHidReportChannelOpen();
    if (logFailure) {
      Serial.printf(
          "WARN bt send_report failed err=%s connected=%s fail_count=%lu\n",
          esp_err_to_name(err),
          boolName(connected_),
          static_cast<unsigned long>(sendReportFailureCount_));
    }
    return false;
  }

  timer_ = static_cast<uint8_t>(timer_ + 1);
  return shouldWaitForSendEvent ? waitForInputReportAccepted(expectedEventCount, logFailure) : true;
}

bool ClassicBtControllerTransport::shouldRetryAfterTransientSendFailure() const {
  return reportCongested_ && isHidReportChannelOpen();
}

bool ClassicBtControllerTransport::waitForInputReportAccepted(
    uint32_t expectedEventCount, bool logFailure) {
  const uint32_t startedAt = millis();

  while (inputReportSendEventCount_ < expectedEventCount) {
    if (millis() - startedAt >= HID_SEND_REPORT_TIMEOUT_MS) {
      if (logFailure) {
        Serial.printf(
            "WARN bt send_report timeout report=48 waited_ms=%u submitted=%lu completed=%lu\n",
            HID_SEND_REPORT_TIMEOUT_MS,
            static_cast<unsigned long>(inputReportSubmitCount_),
            static_cast<unsigned long>(inputReportSendEventCount_));
      }
      return false;
    }
    delay(1);
  }

  if (lastInputReportStatus_ != ESP_HIDD_SUCCESS) {
    if (logFailure) {
      Serial.printf(
          "WARN bt send_report rejected status=%d reason=%u report=%u\n",
          lastInputReportStatus_,
          lastInputReportReason_,
          0x30);
    }
    return false;
  }

  return true;
}

bool ClassicBtControllerTransport::waitForInputReportDrain(uint32_t timeoutMs, bool logFailure) {
  if (!paired_) {
    return true;
  }

  const uint32_t startedAt = millis();
  while (inputReportSendEventCount_ < inputReportSubmitCount_) {
    if (millis() - startedAt >= timeoutMs) {
      if (logFailure) {
        Serial.printf(
            "WARN bt send_report drain timeout waited_ms=%lu submitted=%lu completed=%lu\n",
            static_cast<unsigned long>(timeoutMs),
            static_cast<unsigned long>(inputReportSubmitCount_),
            static_cast<unsigned long>(inputReportSendEventCount_));
      }
      return false;
    }
    delay(1);
  }

  return true;
}

bool ClassicBtControllerTransport::beginExplicitInput() {
  explicitInputActive_ = true;

  if (inputReportSendMutex_ == nullptr) {
    return true;
  }

  if (inputReportSendMutex_ == nullptr) {
    return true;
  }

  xSemaphoreTakeRecursive(inputReportSendMutex_, portMAX_DELAY);

  // Wait for in-flight idle-send BTA callbacks to drain BEFORE resetting the
  // submit/event counters. The idle task may have already posted send_report
  // API calls (mutex given, BTA message queued) whose SEND_REPORT_EVT has not
  // fired yet. If we reset immediately, those pending EVTs will later advance
  // inputReportSendEventCount_ into the range we reserved for explicit sends,
  // causing waitForInputReportAccepted to exit prematurely using the IDLE
  // send's status — making all retries in repeatCurrentInputReport look like
  // they fail even though L2CAP may have cleared congestion.
  if (paired_ && inputReportSendEventCount_ < inputReportSubmitCount_) {
    const uint32_t drainStart = millis();
    while (inputReportSendEventCount_ < inputReportSubmitCount_ &&
           (millis() - drainStart) < 100) {
      delay(1);
    }
    Serial.printf(
        "INFO bt send_report drain submitted=%lu completed=%lu elapsed=%lu\n",
        static_cast<unsigned long>(inputReportSubmitCount_),
        static_cast<unsigned long>(inputReportSendEventCount_),
        static_cast<unsigned long>(millis() - drainStart));
    // Align to actual event count regardless of timeout.
    inputReportSubmitCount_ = inputReportSendEventCount_;
  }
  return true;
}

void ClassicBtControllerTransport::endExplicitInput() {
  if (inputReportSendMutex_ != nullptr) {
    xSemaphoreGiveRecursive(inputReportSendMutex_);
  }
  explicitInputActive_ = false;
}

bool ClassicBtControllerTransport::repeatCurrentInputReport(
    uint16_t durationMs, bool logFailure) {
  const uint32_t startedAt = millis();
  uint32_t congestionStartedAt = 0;
  bool loggedCongestionRetry = false;

  while (true) {
    // Fire-and-forget (waitForSendEvent=false): esp_bt_hid_device_send_report
    // returns ESP_OK when L2CAP accepts the packet into xmit_hold_q even when
    // the channel is congested (L2CAP_DW_CONGESTED). The packet IS queued and
    // WILL be delivered as the ACL link drains. Waiting for the EVT and
    // treating reason=8 as failure causes spurious retries that fill the queue
    // further and block the main loop for hundreds of ms.
    if (!sendCurrentInputReport(logFailure, false)) {
      if (shouldRetryAfterTransientSendFailure()) {
        if (congestionStartedAt == 0) {
          congestionStartedAt = millis();
        }

        if (!loggedCongestionRetry && logFailure) {
          loggedCongestionRetry = true;
          Serial.printf(
              "WARN bt send_report congested retry_window=%u\n",
              kHidCongestionRetryBudgetMs);
        }

        if ((millis() - congestionStartedAt) < kHidCongestionRetryBudgetMs) {
          delay(kHidCongestionRetryDelayMs);
          continue;
        }
      }

